{
  "Data Science": {
    "E-shop Product Matching": "The Shopee Product Matching project aims to improve the online shopping experience by detecting and consolidating duplicate product listings on Shopee’s platform. The goal is to develop a system that can recognize identical products even when they have different names, descriptions, or images, which is essential for accurate search results and recommendations.\n This project combines machine learning techniques in both image analysis and text processing. By analyzing a dataset with product images and descriptions, the system can detect similarities between listings that appear different at first glance. This work helps to streamline the platform by reducing clutter and enhancing product accuracy, directly benefiting users by making searches faster and more reliable.",
    "Cassava Leaf Disease Detection": "In this project, I developed a deep learning pipeline to classify diseases in cassava plants using an image-based dataset. Leveraging TPU acceleration for efficient processing, I incorporated several advanced techniques to improve model accuracy and generalization:\n\n 1. **Bi-Tempered Logistic Loss** – Used to handle noisy labels, a common issue in real-world datasets, to improve model stability.\n 2. **CutMix Augmentation** – This technique blends images, helping the model generalize better across disease classes.\n 3. **RAdam (Rectified Adam) Optimizer** – Chosen to stabilize training across varied learning rates and enhance convergence.\n\n The model architecture is based on EfficientNetB7, pre-trained on ImageNet, and fine-tuned for cassava disease classification with custom layers. I set up a five-fold cross-validation for robustness through bagging, training multiple models and averaging their predictions. Additional measures include:\n\n 4. **Dynamic Learning Rate Scheduler** – Gradually adjusts learning rates to optimize model performance.\n  5. **EarlyStopping and ModelCheckpoint** – Implemented to prevent overfitting and save the best-performing model.\n\n By combining these techniques, I built a reliable, high-performance model ensemble for accurately classifying cassava leaf diseases, supporting agricultural disease management with efficient, scalable machine learning solutions.",
    "Discord Chatbot": "In this project, I built a custom AI-driven Discord chatbot using GPT-3, tailored to facilitate realistic group conversations.\n\n Starting with scraped data from Discord servers, I developed a conversational model that could navigate multi-participant interactions. The data preparation process involved using Numpy, Pandas, and TensorFlow’s Dataset API to streamline data collection, filtering, tokenization, and formatting, ensuring the model could handle diverse conversational flows effectively.\n\n To train the model efficiently, I leveraged Google Cloud TPUs along with Hugging Face libraries, fine-tuning a pre-trained conversational model to maximize performance. Once trained, the model was integrated into a Discord bot, bringing dynamic and engaging interactions to group chat environments. This project not only advanced my skills in deep learning and AI integration but also represented a key technical achievement in conversational AI development.",
    "MLOps System on Cloud": "For this project, I created a system to automatically train and deploy a model on data entries. I've used Vertex AI on google cloud, with a custom docker image for serving predictions through an API."
  },
  "Front End": {
    "Nier Automata themed Portfolio": "This current ",
    "Core application UI Revamp": "Recreated the Core application UI for the company I've worked with, following Good UI/UX design patterns, ",
    "Celery Task Queue UI ": ""
  },
  "Back End": {
    "Celery Insight: Distributed Task Polling": "Created a python package for monitoring celery tasks. Capabilities included being able to see live metadata and progress updates, and the monitoring of parent and child tasks. Although only the redis backend was implemented, the package can be easily extended for other in-memory databases",
    "80x Performance Servers Boost": "Optimized six different interconnected services, fundamentally changing the processing and communication of data, with reports showing an increase of overall task completion speed by up to 8000%.\n Optimizations enabled the company to acquire more clients, undertake ambitious projects, and double in size.",
    "Addition of 150+ Data Validations": "Created more than 150 input and database validations using django-orm, pandas, geopandas and numpy. Validations not only dramatically increased operation speed, but enabled many features such as complete system automation.",
    "Complete Autmation of Tasks": "Achieved complete automation of company workflow by utilizing celery beat to run all client tasks on a monthly basis. Reduced the operational teams workload by around 50%"
  },
  "Technical Infrastructure": {
    "Analysis of 1 Billion Acres of Amazon Rainforest": "Led the technical infrastructure for the analysis of the entire Amazon Rainforest. Used kubernetes on GCP to arbitrarily scale the celery workers.\n\nScaling, optimizations and validations on system enabled to finish the project in a week where it could've took months if not just impossible.",
    "Configurable Database Backup manager": "Made a python backage for creating database backups and stoing them either locally or to cloud services like GCP or AWS. Configurable through use of CLI and yaml file.",
    "Complete On-premise to Cloud Migration": "Led the shift of 8 interconnected services and database to Google Cloud, which enabled the company to arbitrarily scale on-demand.",
    "Cloud Infrastructure for IT Medical Company": "Created a cloud infrastructure for an IT medical company using GCP resources such as kubernetes, databases, cloud run, and much more. Company can now autoscale with minimal to no maintanance cost."
  },
  "Academic": {
    "Academic Paper Published in Elsevier": "Created a computational simulation to investigate the Peter Principle and the efficiency of organizations. The conclusion was that, taking into account multidisciplinary skills and learning, the effects of the Peter principle were minimized, and that the capacity for learning is by far the most valuable attribute in employees for the longevity of a company.",
    "Parallelized Molecular Dynamics Simulation": "Molecular Dynamics Simulation Project: Developed and implemented a molecular dynamics simulation using Van der Waals forces with a crystalline structure in C, optimizing performance through parallelization with MPI."
  }
}
